[{"conference_day":1,"start_time":"09:30","end_time":"10:30","program_session_id":null,"title":"Welcome \u0026 Opening Keynote: David Heinemeier Hansson","presenter":"","room":"South Ballroom","track":"Keynote","description":""},{"conference_day":1,"start_time":"10:30","end_time":"10:50","program_session_id":null,"title":"AM BREAK","presenter":"","room":"South Ballroom Lobby","track":null,"description":""},{"conference_day":1,"start_time":"10:50","end_time":"11:30","program_session_id":94,"title":"The Art \u0026 Craft of Secrets: Using the Cryptographic Toolbox","presenter":"Michael Swieton","room":"South Ballroom","track":"Security","description":"Picking an encryption algorithm is like choosing a lock for your door. Some are better than others - but there's more to keeping burglars out of your house (or web site) than just the door lock. This talk will review what the crypto tools are and how they fit together with our frameworks to provide trust and privacy for our applications. We'll look under the hood of websites like Facebook, at game-changing exploits like Firesheep, and at how tools from our application layer (Rails,) our protocol layer (HTTP,) and our transport layer (TLS) combine build user-visible features like single sign-on."},{"conference_day":1,"start_time":"10:50","end_time":"11:30","program_session_id":117,"title":"The Good Bad Bug: Learning to Embrace Mistakes","presenter":"Jess Rudder","room":"164","track":"Developer Happiness","description":"The history of programming is filled with examples of bugs that actually turned out to be features and limitations that pushed developers to make an even more interesting product. We’ll journey through code that was so ‘bad’ it was actually good. Then we’ll learn to tame our inner perfectionists so our code will be even better than it is today."},{"conference_day":1,"start_time":"10:50","end_time":"11:30","program_session_id":168,"title":"Portable Sessions with JSON Web Tokens","presenter":"Lance Ivy","room":"162","track":null,"description":"Ever wonder why applications use sessions and APIs use tokens? Must there really be a difference? JSON Web Tokens are an emerging standard for portable secure messages. We'll talk briefly about how they're built and how they earn your trust, then dig into some practical examples you can take back and apply to your own majestic monolith or serious services."},{"conference_day":1,"start_time":"10:50","end_time":"11:30","program_session_id":138,"title":"In Relentless Pursuit of REST","presenter":"Derek Prior","room":"160","track":null,"description":"\"That's not very RESTful.\" As a Rails developer you've probably heard or even\r\nspoken that proclamation before, but what does it really mean? What's so great\r\nabout being RESTful anyway?\r\n\r\nRESTful architecture can narrow the responsibilities of your Rails controllers\r\nand make follow-on refactorings more natural. In this talk, you'll learn to\r\nrefactor code to follow RESTful principles and to identify the positive\r\nimpact those changes have throughout your application stack."},{"conference_day":1,"start_time":"10:50","end_time":"11:30","program_session_id":126,"title":"Accessibility (when you don't have time to read the manual)","presenter":"Katie Walsh","room":"156","track":null,"description":"For some, making web applications accessible is a must; Government websites fall under Section 508 and retail sites need to reduce legal risk.\r\n\r\nBut for others it seems like a luxury; Consultants are expensive, and so are the developer hours spent trying to parse the notoriously hard-to-read WCAG 2.0 docs.\r\n\r\nThere is an easier way to start!\r\n\r\nIn this session, we will demystify the WCAG 2.0 basics. We’ll use Chrome Accessibility Dev Tools to discover and fix common issues. You will leave with a set of free and easy-to-use resources to start improving the accessibility of your application today. "},{"conference_day":1,"start_time":"10:50","end_time":"12:20","program_session_id":86,"title":"Building better teams through communication","presenter":"Justin Herrick","room":"152","track":"Workshop","description":"The effectiveness of your team is limited by your communication. To be a great developer we need to be able to express ideas into code. To be a great developer on a team we need to be able to transfer those ideas and that code between other humans.\r\n\r\nIn this workshop we will be focused on improving our own teams by improving our own communication. We will learn how to give more effective and meaningful code feedback, how to break complex ideas down into simple jargon free components, and we will discuss how we can build better teams and streamline our development processes."},{"conference_day":1,"start_time":"10:50","end_time":"12:20","program_session_id":153,"title":"DIY: Home monitoring with Rails \u0026 RaspberryPi","presenter":"Helio Cola","room":"150","track":"Workshop","description":"In a world we teach ourselves a lot of things, why not do it Ruby-on-Rails-on-Pi way? Let’s get our hands on a piece of hardware, understand what it takes to setup one up, install a couple of libraries, Ruby, RVM, RBENV, a GUI. Let’s get a couple of sensors: motion, temperature, humidity, tsunami, ectoplasm and see if we detect a cool thing or two.\r\nLet's discuss how we can use what we know about Rails to explore things on a RaspberryPi. From a practical point of view, we will go through installation, setup, and build a monitoring Motion Sensor application on a RaspberryPi."},{"conference_day":1,"start_time":"11:40","end_time":"12:20","program_session_id":89,"title":"Uncertain Times: Securing Rails Apps and User Data","presenter":"Krista Nelson","room":"South Ballroom","track":"Security","description":"It’s what everyone is talking about: cyber security, hacking and the safety of our data. Many of us are anxiously asking what can do we do? We can implement security best practices to protect our user’s personal identifiable information from harm.  We each have the power and duty to be a force for good.\r\n\r\nSecurity is a moving target and a full team effort, so whether you are a beginner or senior level Rails developer, this talk will cover important measures and resources to make sure your Rails app is best secured."},{"conference_day":1,"start_time":"11:40","end_time":"12:20","program_session_id":107,"title":"Panel: Developer Happiness through Getting Involved","presenter":"Polly Schandorf, Terian Koscik, Sean Marcia, Sarah Mei","room":"164","track":"Developer Happiness","description":"We have amazing skills and abilities, but for a lot of us the missing piece is finding a way to give back. We have an amazing panel of people who have used their skills and talents from both previous careers and current to make the world a better place. Learn how they got involved, and in turn what you can do to get involved in areas you’re passionate about to fill this missing piece that will keep you happy throughout your career."},{"conference_day":1,"start_time":"11:40","end_time":"12:20","program_session_id":161,"title":"Observing Change: A Gold Master Test in Practice","presenter":"Jake Worth","room":"162","track":null,"description":"Tests try to observe change. But are some systems too big to observe them all? What if we need to test a function with a very complex output?\r\n\r\nIn this talk, we'll explore a Gold Master test– a special test for evaluating complicated legacy systems. We'll look at how this test takes an input, such as a production database, runs it through a transformative function, and then compares the output to an approved version of the output.\r\n\r\nTesters of every experience level will leave this talk with a new technique for evaluating complex environments, and a broader conception of what a test can be."},{"conference_day":1,"start_time":"11:40","end_time":"12:20","program_session_id":157,"title":"A Deep Dive Into Sessions","presenter":"Justin Weiss","room":"160","track":null,"description":"What if your Rails app couldn’t tell who was visiting it? If you had no idea that the same person requested two different pages? If all the data you stored vanished as soon as you returned a response? The `session` is the perfect place to put this kind of data.\r\n\r\nBut sessions can be a little magical. What is a session? How does Rails know to show the right data to the right person? And how do you decide where you keep your session data?"},{"conference_day":1,"start_time":"11:40","end_time":"12:20","program_session_id":122,"title":"Goldilocks And The Three Code Reviews","presenter":"Vaidehi Joshi","room":"156","track":null,"description":"Once upon a time, Goldilocks had a few minutes to spare before morning standup. She logged into Github and saw that there were three pull requests waiting for her to review.\r\n\r\nWe've probably all heard that peer code reviews can do wonders to a codebase. But not all types of code reviews are effective. Some of them seem to go on and on forever, while others pick at syntax and formatting but miss bugs. This talk explores what makes a strong code review and what makes a painful one. Join Goldilocks as she seeks to find a code review process that's neither too long nor too short, but just right!"},{"conference_day":1,"start_time":"12:20","end_time":"13:40","program_session_id":null,"title":"LUNCH","presenter":"","room":"Exhibit Hall F\u0026G","track":null,"description":""},{"conference_day":1,"start_time":"13:40","end_time":"14:20","program_session_id":142,"title":"Why Software Engineers Disagree About Everything","presenter":"Haseeb Qureshi","room":"South Ballroom","track":null,"description":"Why are there are so many disagreements in software? Why don’t we all converge on the same beliefs or technologies? It might sound obvious that people shouldn't agree, but I want to convince you it’s weird that we don't. This talk will be a philosophical exploration of how knowledge converges within subcultures, as I explore this question through the worlds of software, online fraud, and poker."},{"conference_day":1,"start_time":"13:40","end_time":"14:20","program_session_id":100,"title":"Understanding ‘Spoon Theory’ and Preventing Burnout","presenter":"Jameson Hampton","room":"164","track":"Developer Happiness","description":"Spoon theory is a metaphor about the finite energy we each have to do things in a day. While a healthy, advantaged person may not have to worry about running out of ‘spoons,’ people with chronic illnesses or disabilities and members of marginalized communities often have to consider how they must ration their energy in order to get through the day. Understanding how 'spoons' can affect the lives of your developers and teammates can help companies lessen the everyday burdens on their underrepresented employees, leaving them more spoons to do their best work, avoid burnout and lead fulfilling lives."},{"conference_day":1,"start_time":"13:40","end_time":"14:20","program_session_id":132,"title":"Exploring the History of a 12-year-old Rails Application","presenter":"Nathan L. Walls","room":"162","track":null,"description":"Come on a journey backward through time from the present all the way to August 2005 to see how a living and evolving Rails application started, changed, and continues.\r\n\r\nFind out some of the challenges and temptations in maintaining this application. See how different influences have coursed through the application as the team changed, the business grew and as Rails and Ruby evolved.\r\n\r\nWe'll explore history through code and learn from some of the developers involved in the application over its lifecycle to build an understanding of where the application is now and how it became what it is."},{"conference_day":1,"start_time":"13:40","end_time":"14:20","program_session_id":137,"title":"Sorting Rubyists","presenter":"Caleb Thompson","room":"160","track":null,"description":"Let's take a peek under the hood of the magical \"sort\" method, learning algorithms... by sorting audience members wearing numbers! Intimidated by the word \"algorithm? Not sure what performance means? Confused by \"Big O Notation\"? Haven't even heard of best-, worst-, and average-case time complexities? No problem: we'll learn together! You can expect to come out knowing new things and with Benny Hill stuck in your head."},{"conference_day":1,"start_time":"13:40","end_time":"14:20","program_session_id":95,"title":"Whose turn is it anyway? Augmented reality board games.","presenter":"Dave Tapley","room":"156","track":"Unconventional Rails","description":"Board games are great, but who has time to keep track of what's going on when you just want to have fun?\r\nIn the spirit of over-engineering we'll look at PitchCar -- probably one of the simplest games in the world -- and see how far we can go with web tech, image processing, and a bunch of math.\r\nExpect to see plenty of code, some surprising problems and solutions, and of course: A live demo."},{"conference_day":1,"start_time":"13:40","end_time":"15:10","program_session_id":116,"title":"RubyMotion for Rails Developers","presenter":"Lori M Olson","room":"152","track":"Workshop","description":"RubyMotion, the Ruby runtime that lets you develop *native* apps for iOS, macOS, watchOS, tvOS, and ANDROID, using your favorite editor, and the Ruby language and Ruby tools that you all know and love. \r\n\r\nCome and get your feet wet developing native applications with RubyMotion Starter (Free!). \r\n\r\n"},{"conference_day":1,"start_time":"13:40","end_time":"15:10","program_session_id":114,"title":"Cool Stuff on Kubernetes: a How To for Rails Developers","presenter":"Jacob Burkhart, Christopher Rigor","room":"150","track":"Workshop","description":"Docker and Kubernetes are both experiencing massive growth in interest and adoption, but so what? Neither one is written in Ruby, why should your average Rails developer care? Let's get hands on with Kubernetes and see exactly how powerful it is as a tool. Blue-Green deployments, Canary Releases, Independently scaling API services. Kubernetes doesn't solve these problems directly, instead it provides a powerful set of abstractions to help you implement them yourself. Each attendee will be given full access to their very own ready-to-go Kubernetes cluster running in the cloud."},{"conference_day":1,"start_time":"14:30","end_time":"15:10","program_session_id":87,"title":"Building Rails ActionDispatch:: SystemTestCase Framework","presenter":"Eileen M. Uchitelle","room":"South Ballroom","track":"Open Source Deep Dive","description":"At the 2014 RailsConf DHH declared system testing would be added to Rails. Three years later, Rails 5.1 makes good on that promise by introducing a new testing framework: ActionDispatch::SystemTestCase. The feature brings system testing to Rails with zero application configuration by adding Capybara integration. After a demonstration of the new framework, we'll walk through what's uniquely involved with building OSS features \u0026 how the architecture follows the Rails Doctrine. We'll take a rare look at what it takes to build a major feature for Rails, including goals, design decisions, \u0026 roadblocks."},{"conference_day":1,"start_time":"14:30","end_time":"15:10","program_session_id":99,"title":"To Code Is Human","presenter":"Don Werve","room":"164","track":"Developer Happiness","description":"Programming is a deeply mental art. As programmers, we invest large amounts of time in mastering new languages, new techniques, and new tools. But all too often, we neglect our understanding of the most important tool in the developer's toolbox: the programmer's brain itself.\r\n\r\nIn this talk, we will combine the art of programming with the science of cognitive psychology, and emerge with a deeper understanding of how to leverage the limits of the human mind to sustainably craft software that is less buggy, easier to understand, and more adaptive in the face of change."},{"conference_day":1,"start_time":"14:30","end_time":"15:10","program_session_id":169,"title":"What Comes After SOLID? Seeking Holistic Software Quality","presenter":"Ariel Caplan","room":"162","track":null,"description":"You care deeply about code quality and constantly strive to learn more. You devour books and blogs, watch conference talks, and practice code katas.\r\n\r\nThat's excellent! But immaculately factored code and clean architecture alone won't guarantee quality software.\r\n\r\nAs a developer, your job isn't to write Good Code. It's to deliver value for people. In that light, we'll examine the effects of a host of popular coding practices. What do they accomplish? Where do they fall short?\r\n\r\nWe'll set meaningful goals for well-rounded, high-quality software that solves important problems for real people."},{"conference_day":1,"start_time":"14:30","end_time":"15:10","program_session_id":131,"title":"Tricks and treats for new developers","presenter":"David Padilla","room":"160","track":null,"description":"Are you ready to begin building applications with Ruby on Rails? It's very easy to follow a tutorial and learn how to build a blog in 15 minutes, but there's a lot more to it in real life when you try to code a big web app.\r\n\r\nDuring this talk I will give you a bunch of tips and tricks for Rails development that almost everyone follows but rarely anyone talks about.\r\n\r\nIf you are about to join this fantastic community, this talk is for you."},{"conference_day":1,"start_time":"14:30","end_time":"15:10","program_session_id":113,"title":"Inventing Friends: ActionCable + AVS = \u003c3","presenter":"Julian Cheal, Jonan Scheffler","room":"156","track":"Unconventional Rails","description":"Chatbots, ActionCable, A.I. and you. And many more buzzwords will enthral you in this talk.\r\n\r\nWe'll learn how to create a simple chatroom in Rails using ActionCable, then how to talk to your colleagues in the office or remote locations using text to speech and Amazon Voice Service.\r\n\r\nUsing the power of ActionCable we will explore how its possible to create an MMMOC: massively multiplayer online chatroom, that you can use TODAY to see your; Travis Build status, or deploy code to your favourite PAAS, let you know when the latest release of Rails is out. Using nothing but your voice and ActionCable."},{"conference_day":1,"start_time":"15:10","end_time":"15:40","program_session_id":null,"title":"PM BREAK","presenter":"","room":"South Lobby","track":null,"description":""},{"conference_day":1,"start_time":"15:40","end_time":"16:20","program_session_id":85,"title":"Perusing the Rails Source Code - A Beginners Guide","presenter":"Alex Kitchens","room":"South Ballroom","track":"Open Source Deep Dive","description":"Open source projects like Rails are intimidating, especially as a beginner. It’s hard to look at the code and know what it does. But Ruby on Rails is more than just code. Written into it are years of research, discussions, and motivations. Also written into it are bugs, typos, and all of the pieces that make the code human. This talk outlines steps you can take to explore the inner workings of Rails and gain context on its design. Understanding how Rails works will allow you to write better Rails applications and better Ruby code. You will leave with many resources and tips on perusing Rails."},{"conference_day":1,"start_time":"15:40","end_time":"16:20","program_session_id":109,"title":"Panel: Better Hiring Practices for Fun and Profit","presenter":"Cecy Correa, Heather Corallo, Justin Herrick, Pamela Vickers","room":"164","track":null,"description":"The average American worker will have 10 jobs before the age of 40. There's a great deal of opportunity and mobility in our industry, and yet, our hiring process is anything but pleasant or streamlined. The hiring process is time consuming for both candidates _and_ employers, but we can do better! Let's explore the ways we can improve the hiring process by writing better job descriptions, utilizing systems that free us from unconscious biases, focusing beyond culture fit, and using better (more fun) technical interviewing methods."},{"conference_day":1,"start_time":"15:40","end_time":"16:20","program_session_id":156,"title":"Decouple your models with form objects","presenter":"Andrew Markle","room":"162","track":null,"description":"Forms are a crucial part of every app and Rails has good defaults for building them—unless you need something complicated. Maybe you want a multi-step wizard? Or maybe you'd like to pluck attributes from any model? Validation becomes a pain point. So you introduce a state machine, or nest your models, or do some other calisthenic to get everything working. Thankfully there's a better way! This talk takes a complicated wizard and converts it into a few simple form objects—it's a deep dive on decoupling models and how you can leverage Trailblazer's Reform gem to make it even easier."},{"conference_day":1,"start_time":"15:40","end_time":"16:20","program_session_id":143,"title":"Rack ‘em, Stack ‘em Web Apps","presenter":"Jason R. Clark","room":"160","track":null,"description":"While Rails is the most common Ruby web framework, it’s not the only option. Rack is a simple, elegant HTTP library, ideal for microservices and high performance applications.\r\n\r\nIn this talk, you’ll see Rack from top to bottom. Starting from the simplest app, we’ll grow our code into a RESTful HTTP API. We’ll test our code, write reusable middleware, and dig through what Rack provides out of the box. Throughout, we’ll balance when Rack is a good fit, and when larger tools are needed.\r\n\r\nIf you’ve heard of Rack but wondered where it fits in the Ruby web stack, here’s your chance!"},{"conference_day":1,"start_time":"15:40","end_time":"16:20","program_session_id":92,"title":"Outside the (Web) Box: Using Ruby for Other Protocols","presenter":"Danielle Adams","room":"156","track":"Unconventional Rails","description":"Ruby on Rails is a widely used web framework, using HTTP to serve users web pages and store data to databases. But what about serving different types of clients? Is it possible to integrate Rails with other protocol types to talk to other machines? Is it efficient? How would it work? I'm going to share my team's approach integrating a Ruby on Rails application with automation and warehouse hardware, such as barcode scanners and Zebra printers."},{"conference_day":1,"start_time":"15:40","end_time":"17:10","program_session_id":150,"title":"Your First API Integration","presenter":"Terian Koscik","room":"152","track":"Workshop","description":"You can create all sorts of interesting programming projects with APIs, but it can be difficult to learn how to use them, or find APIs that are friendly enough to learn with. This workshop is intended for beginner and intermediate programmers who have never played with an API before. Together, we'll go through the process of setting up a small Sinatra app integrated with a free, well-documented API service, from authentication to sending and retrieving data."},{"conference_day":1,"start_time":"15:40","end_time":"17:10","program_session_id":147,"title":"Front-End Performance for Full-Stack Developers","presenter":"Nate Berkopec","room":"150","track":"Workshop","description":"Are you a full-stack developer and have a slow website? Let's fix that! This workshop is an introduction to improving page load times and general front-end performance for Rails full-stack devs. Some literacy with Javascript, HTML and CSS is assumed, but you don't have to be up-to-date on the latest Javascript trends (let's face it, no one is!). Bring a Rails application and your laptop and let's get working."},{"conference_day":1,"start_time":"16:30","end_time":"17:10","program_session_id":96,"title":"Teaching RSpec to Play nice with Rails","presenter":"Sam Phippen","room":"South Ballroom","track":"Open Source Deep Dive","description":"RSpec gives you many ways to test your Rails app. Controller, view, model, and so on. Often, it's not clear which to use. In this talk, you'll get some practical advice to improve your testing by understanding how RSpec integrates with Rails. To do this we'll look through some real world RSpec bugs, and with each one, clarify our understanding of the boundaries between RSpec and Rails.\r\n\r\nIf you're looking to level up your testing, understand RSpec's internals a little better, or improve your Rails knowledge, this talk will have something for you. Some knowledge of RSpec's test types will be assumed."},{"conference_day":1,"start_time":"16:30","end_time":"17:10","program_session_id":110,"title":"We've always been here: Women changemakers in tech","presenter":"Hilary Stohs-Krause","room":"164","track":null,"description":"Steve Jobs. Linus Torvalds. Alan Turing.\r\n\r\nBeen there, done that.\r\n\r\nThe interesting stories often aren’t the ones we grew up with; they’re the ones we’ve left behind. When it comes to tech, that means its women, and especially its women of color. And while there’s been a greater emphasis lately on rediscovering women’s contributions to technology, we need to expand our focus beyond just Grace Hopper and Ada Lovelace.\r\n\r\nFrom Radia Perlman to Sophie Wilson to Erica Baker, let's explore both tech’s forgotten heroes and its modern-day pioneers, and help end the silent erasure of women in technology."},{"conference_day":1,"start_time":"16:30","end_time":"17:10","program_session_id":179,"title":"Deep Dive Into Docker Containers for Rails Developers","presenter":"Christopher Rigor","room":"162","track":"Sponsored","description":"Containers have gained popularity the past few years but they have been around much longer than that. In this talk, we'll dive into the internals of a container. If you have used or heard about Docker containers but are unsure how they work, this talk is for you.\r\n\r\n\u2028You’ll also learn how to run Rails in production-ready container environments like Kubernetes."},{"conference_day":1,"start_time":"16:30","end_time":"17:10","program_session_id":140,"title":"Practical Debugging","presenter":"Kevin Deisz","room":"160","track":null,"description":"People give ruby a bad reputation for speed, efficiency, weak typing, etc. But one of the biggest benefits of an interpreted language is the ability to debug and introspect quickly without compilation. Oftentimes developers reach for heavy-handed libraries to debug their application when they could just as easily get the information they need by using tools they already have.\r\n\r\nIn this talk you will learn practical techniques to make debugging easier. You will see how simple techniques from the ruby standard library can greatly increase your ability to keep your codebase clean and bug-free."},{"conference_day":1,"start_time":"16:30","end_time":"17:10","program_session_id":98,"title":"Implementing the Web Speech API for Voice Data Entry","presenter":"Cameron Jacoby","room":"156","track":"Unconventional Rails","description":"We live in a world where you can schedule a meeting by talking to your watch or turn off your lights by asking Alexa as if she were your roommate. But would voice dictation work for something more intensive, like a web app used for hours of data entry?\r\n\r\nIn this talk, I’ll show you how to implement the Web Speech API in a few simple steps. I’ll also walk through a case study of using the API in a production Rails app. You’ll leave with an understanding of how to implement voice dictation on the web as well as criteria to evaluate if voice is a viable solution to a given problem."},{"conference_day":1,"start_time":"17:20","end_time":"18:10","program_session_id":null,"title":"Keynote: Pamela Pavliscak","presenter":"","room":"South Ballroom","track":"Keynote","description":""},{"conference_day":2,"start_time":"09:00","end_time":"10:00","program_session_id":null,"title":"Keynote: Justin Searls","presenter":"","room":"South Ballroom","track":"Keynote","description":""},{"conference_day":2,"start_time":"10:00","end_time":"10:50","program_session_id":null,"title":"AM BREAK","presenter":"","room":"Exhibit Hall F\u0026G","track":null,"description":""},{"conference_day":2,"start_time":"10:50","end_time":"11:30","program_session_id":97,"title":"Rough to Fine: Programming Lessons from Woodworking","presenter":"Mark Simoneau","room":"South Ballroom","track":"Productivity","description":"Woodworking has experienced quite a renaissance as of late, and a very popular style involves using power tools for rough work and hand tools for detail and precision work. Using both defines each woodworker's speed and ability to produce beautiful/functional pieces. The same can be true of developers. What can we as developers learn from this mix of modern and ancient craft? Come find out."},{"conference_day":2,"start_time":"10:50","end_time":"11:30","program_session_id":90,"title":"Leading When You're Not in Charge","presenter":"Scott Lesser","room":"164","track":"Leading at all Levels","description":"Just because you don't have lead / senior / manager / owner in your title, doesn't mean there isn't plenty of opportunity to lead. No matter where you are in your career, come discover how to communicate more effectively, embrace self-awareness, and influence those leading you. Don't wait for a title to tell you to lead. Take responsibility where you are, and let the titles come to you."},{"conference_day":2,"start_time":"10:50","end_time":"11:30","program_session_id":171,"title":"Google Cloud \u003c3 Ruby","presenter":"Remi Taylor","room":"162","track":"Sponsored","description":"This is a sponsored talk by Google Cloud Platform.\r\n\r\nRuby developers welcome! Our dedicated Google Cloud Platform Ruby team has built a great experience for Ruby developers using GCP. In this session, we'll walk through the steps to deploy, debug and scale a Ruby on Rails application on Google App Engine. You'll also learn about some of the exciting Ruby libraries available today for adding features to your app with GCP services like BigQuery and Cloud Vision API."},{"conference_day":2,"start_time":"10:50","end_time":"11:30","program_session_id":128,"title":"Developer Happiness on the Front End with Elm","presenter":"Kevin Yank","room":"160","track":null,"description":"Ruby and Rails famously prioritised developer happiness, and took the world by storm. Elm, a new language that compiles to JavaScript, proves that putting developer happiness first can produce very different results on the front end! Born out of Haskell, Elm is as unlike Ruby as programming languages get, but in this session we’ll see how its particular blend of design decisions tackles everything that’s painful about front-end development, making it an excellent choice for the curious Rubyist’s next favorite language."},{"conference_day":2,"start_time":"10:50","end_time":"11:30","program_session_id":101,"title":"Is it Food? An Introduction to Machine Learning","presenter":"Matthew Mongeau","room":"156","track":"Machine Learning","description":"Machine Learning is no longer just an academic study. Tools like Tensorflow have opened new doorways in the world of application development. Learn about the current tools available and how easy it is to integrate them into your rails application. We'll start by looking at a real-world example currently being used in the wild and then delve into creating a sample application that utilizes machine learning. "},{"conference_day":2,"start_time":"10:50","end_time":"12:20","program_session_id":166,"title":"Making Moves With React","presenter":"Rushaine McBean","room":"152","track":"Workshop","description":"JavaScript is everywhere and so are its frameworks. There’s tons of pressure and excitement to choose the right or cool tool to be used in your app but we don’t talk enough about how to use it in a production app that may or may not have an existing JavaScript structure.  In this talk, I walk you through the some of tools from the React ecosystem that can be brought into your existing app and how to work around tutorials that mostly geared towards greenfield projects. "},{"conference_day":2,"start_time":"10:50","end_time":"12:20","program_session_id":104,"title":"Refactoring for Machine Dignity","presenter":"Evan Burchard","room":"150","track":"Workshop","description":"A major goal of refactoring is turning bad code into good code, but on what basis can we differentiate? There are countless opinions on the subject, but in this workshop, we'll assume a radical position: good code is that which allows our machines dignity in their work. With that assumption, we'll take a fresh (and memorable) look at refactoring."},{"conference_day":2,"start_time":"11:40","end_time":"12:20","program_session_id":119,"title":"Warning: May Be Habit Forming","presenter":"Nickolas Means","room":"South Ballroom","track":"Productivity","description":"Over the past year, I’ve spoken at several conferences, lost 30 pounds, and worked up to running my first 5K, all while leading an engineering team and spending significant time with my family. I also have less willpower than just about everyone I know. So how’d I accomplish those things?\r\n\r\nLet’s talk about how to build goals the right way so that you’ll be all but guaranteed to hit them. We’ll work through the process of creating systems and nurturing habits to turn your brain into your biggest ally, no matter what you want to accomplish!"},{"conference_day":2,"start_time":"11:40","end_time":"12:20","program_session_id":82,"title":"Bebop to the Top - The Jazz Band As A Guide To Leadership","presenter":"Michael Cain","room":"164","track":"Leading at all Levels","description":"The ideal workplace, with motivated employees, supportive managers and a clear vision in the \"C-suite\", is where we'd all like to work, isn't it? The question then, is, how do we create it? How do managers walk the fine line of \"micromanaging\" and \"anarchy\"? How can we, as employees, maximize our contribution to our company and love what we do at the same time?\r\n\r\nThe secret is in the big band.\r\n\r\nInspired by Max Dupree's _Leadership Jazz_, this talk will show you how to apply the principles of improvisation to your company/team and make your workplace more efficient, effective and fun!"},{"conference_day":2,"start_time":"11:40","end_time":"12:20","program_session_id":173,"title":"Tailoring Mentorship: Achieving the Best Fit\u2028","presenter":"Jonathan Wallace","room":"162","track":"Sponsored","description":"This is a sponsored talk by Stitch Fix.\r\n\r\nIn this talk, you'll learn how to establish effective, quality mentoring relationships where both parties grow their skills—and their career.  Mentoring accelerates your personal and career growth. Come learn how much you'll grow by sharing your knowledge and experience using practices like inquiry-based learning, differentiated learning, and active listening."},{"conference_day":2,"start_time":"11:40","end_time":"12:20","program_session_id":136,"title":"Rails to Phoenix: How Elixir can level-you-up in Rails","presenter":"Christian Koch","room":"160","track":null,"description":"Elixir has rapidly developed into a mature language with an ever-growing library of packages that excels at running web apps. And because both Elixir and Phoenix were developed by Ruby / Rails programmers, the ease with which you can learn Elixir as a Ruby developer, is much greater than many other  languages. With numerous code examples, this talk will discuss how learning a functional approach to handling web requests can improve what we do every day with Rails. This talk is aimed at people who have some familiarity with Rails but no experience with Elixir is necessary."},{"conference_day":2,"start_time":"11:40","end_time":"12:20","program_session_id":80,"title":"Predicting Titanic Survivors with Machine Learning","presenter":"Ju Liu","room":"156","track":"Machine Learning","description":"What's a better way to understand machine learning than a practical example? And who hasn't watched the 1997 classic with Jack and Rose? In this talk we will first take a look at some real historical data of the event. Then we will use amazing Python libraries to live code several of the most well known algorithms. This will help us understand some fundamental concepts of how machine learning works. When we're done, you should have a good mental framework to make sense of it in the modern world."},{"conference_day":2,"start_time":"12:20","end_time":"13:50","program_session_id":null,"title":"LUNCH","presenter":"","room":"Exhibit Hall F\u0026G","track":null,"description":""},{"conference_day":2,"start_time":"13:50","end_time":"14:30","program_session_id":125,"title":"Rails 5.1: awesome features and breaking changes","presenter":"Claudio B.","room":"South Ballroom","track":null,"description":"Each minor release of Rails brings shiny new features and mild headaches for developers required to upgrade their applications and gems.\r\n\r\nRails 5.1 will support Yarn and modern Javascript transpilers, remove jQuery from the default stack, integrate system testing and a concurrent test runner, introduce a new helper to create forms, provide encrypted secrets and more.\r\n\r\nIn this talk, I will cover the improvements brought by Rails 5.1, explain the Core team’s motivations behind each feature, and illustrate the upgrade process to smoothly transition gems and apps from Rails 5.0 to Rails 5.1."},{"conference_day":2,"start_time":"13:50","end_time":"14:30","program_session_id":102,"title":"Supporting Mental Health as an Effective Leader","presenter":"Jesse James","room":"164","track":"Leading at all Levels","description":"As the stigma of speaking out about mental health conditions declines, leaders in the programming community are are being given many new opportunities to support their teams.  In this session you will learn about the issues some of your team may face both in dealing with their own potential mental health difficulties and that of other team members.  We will go over ways to support both the individual and team, how to advocate for team members with mental health conditions, and resources for further information and outreach for you and your team."},{"conference_day":2,"start_time":"13:50","end_time":"14:30","program_session_id":172,"title":"​Postgres at Any Scale​","presenter":"Will Leinweber","room":"162","track":"Sponsored","description":"This is a sponsored talk by Citus Data.\r\n\r\nPostgres has powerful datatypes and a general emphasis on correctness which makes it a great choice for apps small and medium. Growing to very large sizes has been challenging—until now!\r\n\r\nFirst you'll learn how to take advantage of all PG has to offer for small scales, especially when it comes to keeping data consistent. Next you'll learn techniques for keeping apps running well at medium scales. And finally you'll learn how to take advantage of the open-source Citus extension that makes PG a distributed db, when your app joins the big leagues."},{"conference_day":2,"start_time":"13:50","end_time":"14:30","program_session_id":144,"title":"React on Rails","presenter":"Jo Cranford","room":"160","track":null,"description":"Eighteen months ago, our fairly typical Ruby on Rails app had some mundane client side interactions managed by a tangle of untested JQuery spaghetti. \r\n\r\nToday, new features are built with React, CSS modules, and a far better UX. With ES6 front end code, processed with Babel, compiled (and hot-reloaded in development) with Webpack, and tested with Jest – all within the same Rails application. \r\n\r\nCome along to this talk to hear how we migrated our app a piece at a time to use technologies that don’t always sit naturally alongside Rails. I will cover technical implementations and lessons learned. "},{"conference_day":2,"start_time":"13:50","end_time":"14:30","program_session_id":81,"title":"Bayes is BAE","presenter":"Richard Schneeman","room":"156","track":"Machine Learning","description":"Before programming, before formal probability there was Bayes. He introduced the notion that multiple uncertain estimates which are related could be combined to form a more certain estimate. It turns out that this extremely simple idea has a profound impact on how we write programs and how we can think about life. The applications range from machine learning and robotics to determining cancer treatments. In this talk we'll take an in depth look at Bayses rule and how it can be applied to solve problems in programming and beyond."},{"conference_day":2,"start_time":"13:50","end_time":"16:10","program_session_id":112,"title":"Elm For Rails Developers","presenter":"Brad Grzesiak","room":"152","track":"Workshop","description":"Learn to write in Elm, an exciting new front-end language that lets you to write predictable and productive functionality in the browser. Elm is a functional programming language that compiles to JavaScript and prohibits runtime crashes. After a brief introduction to syntax and semantics, we'll pair off and begin building our first Elm application: a cooperative starship shooter game... with Rails backend, of course! Topics to be covered include: the amazingly helpful compiler, how to construct your own types, WebSockets, JSON parsing, and functional programming concepts."},{"conference_day":2,"start_time":"13:50","end_time":"16:10","program_session_id":118,"title":"TDD: From feature to tests to implementation","presenter":"Jay Hayes","room":"150","track":"Workshop","description":"You have likely heard of test-driven development. In many circles it's touted as the only way to write software. Indeed, TDD is a powerful tool in writing software that not only works, but continues to work as time and features pass. However, when learning to test-drive software, you're often left confused about where to start and which direction to go.\r\n\r\nThis talk will provide some some gentle advice about TDD as we interactively iterate on an app starting with a proposed feature, adding tests, building the implementation, and refactoring to the final solution."},{"conference_day":2,"start_time":"14:40","end_time":"15:20","program_session_id":133,"title":"Upgrading a big application to Rails 5","presenter":"Rafael França","room":"South Ballroom","track":null,"description":"In this talk we would take a look in different strategies to upgrade Rails application to the newest version taking as example a huge monolithic Rails application. We will learn what were the biggest challenges and how they could be avoided. We will also learn why the changes were made in Rails and how they work."},{"conference_day":2,"start_time":"14:40","end_time":"15:20","program_session_id":163,"title":"It's dangerous to go alone: Building teams like an organizer","presenter":"Colin Fleming","room":"164","track":"Leading at all Levels","description":"Leading an open source or community project means dealing with people challenges in addition to technical challenges -- how do we take a scattering of interested people and build a team with them? Turns out, we can adapt a bunch of practices we already use! Using a collaboration between a nonprofit and a civic group as a case study, we'll talk about ways to apply best practices from community organizers to our work. In particular, we'll talk about similarities between contemporary organizing and agile models, ways to build relationships with other team members, and making our work more sustainable."},{"conference_day":2,"start_time":"14:40","end_time":"15:20","program_session_id":177,"title":"​Introducing Helix: High-Performance Ruby Made Easy","presenter":"Godfrey Chan, Yehuda Katz","room":"162","track":"Sponsored","description":"This is a sponsored talk by Skylight.\r\n\r\nWe got a good productivity boost by writing the original Skylight agent in Ruby, but over time, we couldn't implement all the desired features with its overhead. Ruby is fast enough... until it isn't.\r\n\r\nIntroducing Helix — an open-source toolkit for writing native Ruby extensions in Rust, extracted from our Featherweight Agent's DNA. Fast, reliable, productive — pick three. Come join us to find out how you can leverage this power in your Ruby apps and even help make Rails faster!\r\n\r\n(This is not a re-run of Godfrey's talk from last year.)"},{"conference_day":2,"start_time":"14:40","end_time":"15:20","program_session_id":154,"title":"React Native \u0026 Rails, a single codebase for Web \u0026 Mobile","presenter":"Ben Dixon","room":"160","track":null,"description":"Rails made building CRUD apps efficient and fun. React Native, for the first time, does this for mobile Apps. Learn how to create a single React codebase for Android, iOS and Mobile Web, backed by a common Rails API. "},{"conference_day":2,"start_time":"14:40","end_time":"15:20","program_session_id":103,"title":"Syntax Isn't Everything: NLP for Rubyists","presenter":"Aja Hammerly","room":"156","track":"Machine Learning","description":"Natural Language Processing is an interesting field of computing. The way humans use language is nuanced and deeply context sensitive. For example, the word work can be both a noun and a verb. This talk will give an introduction to the field of NLP using Ruby.  There will be demonstrations of how computers fail and succeed at human language. You'll leave the presentation with an understanding of both the challenges and the possibilities of NLP and some tools for getting started with it. "},{"conference_day":2,"start_time":"15:30","end_time":"16:10","program_session_id":162,"title":"The Arcane Art of Error Handling","presenter":"Brad Urani","room":"South Ballroom","track":null,"description":"With complexity comes errors, and unexpected errors lead to unexpected unhappiness. Join us and learn how to add contextual data to errors, design error hierarchies, take charge of control flow, create re-usable error handlers, and integrate with error reporting solutions. We'll talk about recoverable versus irrecoverable errors and discuss how and how not to use exceptions. From internationalization to background jobs, we'll cover the gamut. Regardless of your Rail proficiency, you'll learn why expecting the unexpected makes for happier developers, happier businesses and happier users."},{"conference_day":2,"start_time":"15:30","end_time":"16:10","program_session_id":105,"title":"Panel: Becoming an engineering leader","presenter":"Rebecca Miller-Webster, Neha Batra, Shay Howe, Abel Martin","room":"164","track":"Leading at all Levels","description":"Are you a new manager? Have you been asked to lead a project? Do you want to see change in your company but don't feel you have the position to enact it? Are you terrified or nervous or unsure where to start? Has a recent situation left you questioning what you did wrong and how to be a better leader? \r\n\r\nSoftware development doesn't prepare us for taking on everyday or official leadership and yet, leadership is what every team and company desperately need.\r\n\r\nLet talk with a group of folks at various stages of the leadership hierarchy about what they have and want to learn.\r\n"},{"conference_day":2,"start_time":"15:30","end_time":"16:10","program_session_id":170,"title":"Your App Server Config is Wrong\u2028","presenter":"Nate Berkopec","room":"162","track":"Sponsored","description":"This is a sponsored talk by Heroku.\r\n\r\nAs developers we spend hours optimizing our code, often overlooking a simpler, more efficient way to make quick gains in performance: application server configuration.\r\n\r\nCome learn about configuration failures that could be slowing down your Rails app. We’ll use tooling on Heroku to identify configuration that causes slower response times, increased timeouts, high server bills and unnecessary restarts.\r\n\r\nYou’ll be surprised by how much value you can deliver to your users by changing a few simple configuration settings."},{"conference_day":2,"start_time":"15:30","end_time":"16:10","program_session_id":151,"title":"A Survey of Surprisingly Difficult Things","presenter":"Alex Boster","room":"160","track":null,"description":"Many seemingly simple \"real-world\" things end up being much more complicated than anticipated, especially if it's a developer's first time dealing with that particular thing. Classic examples include money and currency, time, addresses, human names, and so on. We will survey a number of these common areas and the state of best practices, or lack thereof, for handling them in Rails."},{"conference_day":2,"start_time":"15:30","end_time":"16:10","program_session_id":160,"title":"How to write better code using mutation testing","presenter":"John Backus","room":"156","track":null,"description":"Mutation testing is a silver bullet for assessing test quality. Mutation testing will help you: \r\n\r\n* Write better tests\r\n* Produce more robust code that better handles edge cases\r\n* Reveal what parts of your legacy application are most likely to break before you dive in to make new changes\r\n* Learn about features in Ruby and your dependencies that you didn’t previously know about\r\n\r\nThis talk assumes a basic knowledge of Ruby and testing. The examples in this talk will almost certainly teach you something new about Ruby!"},{"conference_day":2,"start_time":"16:10","end_time":"17:30","program_session_id":null,"title":"PM BREAK","presenter":"","room":"Exhibit Hall F\u0026G","track":null,"description":""},{"conference_day":2,"start_time":"17:30","end_time":"19:00","program_session_id":null,"title":"LIGHTNING TALKS","presenter":"","room":"South Ballroom","track":"Keynote","description":""},{"conference_day":3,"start_time":"09:00","end_time":"10:00","program_session_id":null,"title":"Keynote: Marco Rogers","presenter":"","room":"South Ballroom","track":"Keynote","description":""},{"conference_day":3,"start_time":"10:00","end_time":"10:50","program_session_id":null,"title":"AM BREAK","presenter":"","room":"Exhibit Hall F\u0026G","track":null,"description":""},{"conference_day":3,"start_time":"10:50","end_time":"11:30","program_session_id":145,"title":"An Optimistic Proposal for Making Horrible Code... Bearable.","presenter":"Joseph Mastey","room":"South Ballroom","track":"Code Organization","description":"The attempted rewrite is over, the dust has settled, and the monolith isn’t going away. After all, it’s still the app that makes all the money. On the other hand, nobody wants to work on it, every new feature takes forever, and your entire team is afraid of making any change for fear of the whole thing collapsing in on itself.\r\n\r\nIn this session, we’ll walk through some of the technical and social problems that arise from difficult codebases. We’ll learn to stop making things worse, to measure what we need to change, and start making progress.\r\n\r\nIn the thousand mile journey, here are the first steps."},{"conference_day":3,"start_time":"10:50","end_time":"11:30","program_session_id":121,"title":"Panel: Ruby's Killer Feature: The Community","presenter":"Sean Marcia, Christopher Sexton, LaToya Allen, Zuri Hunter","room":"164","track":null,"description":"What makes Ruby so wonderful? The Community.\r\n\r\nThe community around Ruby is really what sets it apart, and the cornerstone of it is the small local meetups. Come learn how to get involved, help out, or step up and start a local group of your own. We will discuss how to develop and nurture the group. Share our experiences in expanding a small group to larger events like unconferences or workshops. Find out how community leaders can help everyone build a solid network, assist newbies in kick-starting their career, and most importantly ensure that everyone feels welcome and safe."},{"conference_day":3,"start_time":"10:50","end_time":"11:30","program_session_id":176,"title":"Cultivating a Culture of Continuous Learning","presenter":"Dave Ott, Dennis Eusebio","room":"162","track":"Sponsored","description":"This is a sponsored talk by Tuft \u0026 Needle.\r\n\r\nTuft \u0026 Needle is a bootstrapped, Phoenix-based company that pioneered the disruption of a the mattress industry using a software startup’s mindset when it was founded in 2012 and has grown to over $100 million in annual revenue. A commitment to skill acquisition has led to a happier and more productive team, and is a core to the company’s success. In this session, learn how to cultivate a culture of continuous learning and skill acquisition through apprenticeships and group learning sessions."},{"conference_day":3,"start_time":"10:50","end_time":"11:30","program_session_id":146,"title":"Data Integrity in Living Systems","presenter":"Betsy Haibel","room":"160","track":null,"description":"Ever had a production bug that you fixed by changing production data? Ever felt like a bad developer for it? Don't. Bad data has countless causes: Weird user input. Race conditions under load. Heck, even changing business needs. We can't fully prevent data corruption, so what matters is how we recover. In this talk, you'll learn how to prevent and fix bad data at every level of your system. You'll learn UX techniques for incremental, mistake-reducing input. You'll learn how to future-proof validations. And you'll learn auditing techniques to catch bad data -- before your users do."},{"conference_day":3,"start_time":"10:50","end_time":"11:30","program_session_id":165,"title":"A clear-eyed look at distributed teams","presenter":"Maria Gutierrez, Glenn Vanderburg","room":"156","track":"Distributed Teams","description":"Distributed teams can have big benefits for both employers and employees. But there are many challenges. Being successful requires changes to work practices, communication, and style — and not just from the remote people.  Everyone will experience changes. It helps to be prepared … and most of what we see being written and discussed is focused on remote workers, not the organization that supports them.\r\n\r\nIn this talk, we will look at the challenges and rewards of working in a distributed team setting based on several years of experience growing large distributed engineering teams."},{"conference_day":3,"start_time":"10:50","end_time":"12:20","program_session_id":106,"title":"Make your life easier with shell scripting and UNIX tools","presenter":"Devon Estes","room":"152","track":"Workshop","description":"A smart man named Larry Wall once said the three virtues of a programmer are laziness, impatience and hubris. Well, if you're not using shell scripts to automate your work, then you're probably not being lazy to your full potential!\r\n\r\nIn this workshop you'll need no prior knowledge of shell programming other than a basic familiarity of how to use a terminal, and you'll come away with the knowledge needed to write some simple but effective functions and scripts. We'll also go over how to use some of the helpful UNIX tools like `cat`, `head`/`tail`, `grep`, `sed`, `awk`, `xargs` and more!"},{"conference_day":3,"start_time":"10:50","end_time":"12:20","program_session_id":120,"title":"Demystifying interface design","presenter":"Wes Oudshoorn","room":"150","track":"Workshop","description":"In this workshop, developers will learn practical models that take the magic out of design. Because even though design is creative work and sometimes needs a spark of inspiration, there's not much wizardry involved. We will run through—practice with—a few much used design models. After this workshop you will be able to hire better designers, give better feedback to designers, and know how to improve an interface without a designer there to help you."},{"conference_day":3,"start_time":"11:40","end_time":"12:20","program_session_id":141,"title":"Built to last: A domain-driven approach to beautiful systems","presenter":"Andrew Hao","room":"South Ballroom","track":"Code Organization","description":"Help! Despite following refactoring patterns by the book, your aging codebase is messier than ever. If only you had a key architectural insight to cut through the noise.\r\n\r\nToday, we'll move beyond prescriptive recipes and learn how to run a Context Mapping exercise. This strategic design tool helps you discover domain-specific system boundaries, leading to highly-cohesive and loosely-coupled outcomes. With code samples from real production code, we'll look at a domain-oriented approach to organizing code in a Rails codebase, applying incremental refactoring steps to build stable, lasting systems!\r\n"},{"conference_day":3,"start_time":"11:40","end_time":"12:20","program_session_id":84,"title":"5 Years of Rails Scaling to Support Massive Sales","presenter":"Simon Eskildsen","room":"164","track":"High Volume","description":"Shopify has taken Rails through some of the world's largest sales: Superbowl, Celebrity Launches, and Black Friday. In this talk, we will go through the evolution of the Shopify infrastructure: from re-architecting and caching in 2012, sharding in 2013, and reducing the blast radius of every point of failure in 2014. To 2016, where we accomplished running our 325,000+ stores out of multiple datacenters. It'll be whirlwind tour of the lessons learned scaling one of the world's largest Rails deployments for half a decade."},{"conference_day":3,"start_time":"11:40","end_time":"12:20","program_session_id":175,"title":"Open Sourcing: Real Talk","presenter":"Andrew Evans","room":"162","track":"Sponsored","description":"This is a sponsored talk by Hired.\r\n\r\nHired open-sources some useful abstractions from our Majestic Monolith® and we've learned a lot. Some tough lessons, and some cool knowledge. We'll cover: When \u0026 where should you pull something out of the code? Does it really help? What things are important to think about? What if it never takes off? We'll also look at some design patterns from our open-source work."},{"conference_day":3,"start_time":"11:40","end_time":"12:20","program_session_id":139,"title":"Beyond validates_presence_of: ensuring eventual consistency","presenter":"Amy Unger","room":"160","track":null,"description":"You've added background jobs. You have calls to external services that perform actions asynchronously. Your data is no longer always in one perfect state-- it's in one of tens or hundreds of acceptable states.\r\n\r\nHow can you confidently ensure that your data is valid without validations?\r\n\r\nIn this talk, I’ll introduce some data consistency issues you may see in your app when you begin introducing background jobs and external services. You’ll learn some patterns for handling failure so your data never gets out of sync and we’ll talk about strategies to detect when something is wrong."},{"conference_day":3,"start_time":"11:40","end_time":"12:20","program_session_id":164,"title":"Distributed \u0026 Local: Getting the Best of Both Worlds","presenter":"Ben Klang","room":"156","track":"Distributed Teams","description":"Our company is traditional in many ways, one of which being the need to come into the office each day. Our team of software developers bucks that trend, spreading across 6 states and 4 countries. Dev teams consider themselves \"Remote First\", while DevOps and Application Support are \"Local First.\" Each has adopted tools, habits, and practices to maximize their configuration. Each style has learned valuable lessons from the other. This presentation is about how our teams have evolved: the tools, the compromises, the wins and losses, and how we successfully blend Distributed and Concentrated teams."},{"conference_day":3,"start_time":"12:20","end_time":"13:50","program_session_id":null,"title":"LUNCH","presenter":"","room":"Exhibit Hall F\u0026G","track":null,"description":""},{"conference_day":3,"start_time":"13:50","end_time":"14:30","program_session_id":123,"title":"Architecture: The Next Generation","presenter":"Taylor Jones","room":"South Ballroom","track":"Code Organization","description":"As our applications grow, we start thinking of better ways to organize and scale our growing codebases. We've recently seen Microservices start to emerge as a prominent response to Monoliths, but is it all really worth it? What about our other options? We often romanticize leaving our current architecture situation because we believe it will cure what ails us. However, architecture certainly has no silver bullet . Beam up with me as we explore the past, present, and future of reconsidering architecture. "},{"conference_day":3,"start_time":"13:50","end_time":"14:30","program_session_id":83,"title":"Processing streaming data at a large scale with Kafka","presenter":"Thijs Cadier","room":"164","track":"High Volume","description":"Using a standard Rails stack is great, but when you want to process streams of data at a large scale you'll hit the stack's limitations. What if you want to build an analytics system on a global scale and want to stay within the Ruby world you know and love?\r\n\r\nIn this talk we'll see how we can leverage Kafka to build and painlessly scale an analytics pipeline. We'll talk about Kafka's unique properties that make this possible, and we'll go through a full demo application step by step. At the end of the talk you'll have a good idea of when and how to get started with Kafka yourself."},{"conference_day":3,"start_time":"13:50","end_time":"14:30","program_session_id":180,"title":"​Rails APIs: The Next Generation","presenter":"Derek Carter","room":"162","track":"Sponsored","description":"This is a sponsored talk by Procore.\r\n\r\nBuilding a consistent API for a large and long-running monolithic API on a tool-segmented engineering team can sometimes feel like herding cats. REST, serializers, and Swagger: Oh my! Learn what worked (and didn’t!) as we go behind the scenes building Procore’s first open API."},{"conference_day":3,"start_time":"13:50","end_time":"14:30","program_session_id":135,"title":"The Secret Life of SQL: How to optimize database performance","presenter":"Bryana Knight","room":"160","track":null,"description":"There are a lot of database index and query best practices that sometimes aren't best practices at all. Need all users created this year? No problem! Slap an index over created_at! What about this year's active OR pending users, sorted by username? Are we still covered index-wise? Is the query as fast with 20 million users? Common rules of thumb for indexing and query crafting aren’t black and white. We'll discuss how to track down these exceptional cases and walk through some real examples. You'll leave so well equipped to improve performance, you won't be able to optimize fast enough!          "},{"conference_day":3,"start_time":"13:50","end_time":"14:30","program_session_id":134,"title":"The Effective Remote Developer","presenter":"David Copeland","room":"156","track":"Distributed Teams","description":"Being on a distributed team, working from your home or coffee shop isn't easy, but it can be incredibly rewarding.  Making it work requires constant attention, as well as support from your team and organization.  It's more than just setting up Slack and buying a webcam.\r\n\r\nWe'll learn what you can do to be your best self as a remote team member, as well as what you need from your environment, team, and company.  It's not about technical stuff—it's the human stuff. We'll learn how can you be present and effective when you aren't physically there."},{"conference_day":3,"start_time":"13:50","end_time":"16:10","program_session_id":111,"title":"Love Your Database","presenter":"Guyren G Howe","room":"152","track":"Workshop","description":"Rails started with MySQL, which is awful, so we used it as a dumb data bucket.\r\n\r\nNow we all use Postgres, which is amazing, so we should take full advantage of it.\r\n\r\nThis hands-on session will teach advanced SQL querying with Common Table Expressions and Window Functions, as well as doing validations in the database, and finishing up with executing Ruby code on the database server itself, where it runs much faster and can be shared between applications easily."},{"conference_day":3,"start_time":"13:50","end_time":"16:10","program_session_id":115,"title":"Structuring your application flow with command chains","presenter":"Benjamin Roth","room":"150","track":"Workshop","description":"We have all experienced moments when our app does not work as expected: Failing validations, libraries raising exceptions, web services becoming unavailable. When this happens, our code ends up becoming defensive against potential failure and overall quality deteriorates.\r\nWhat if we could simplify the process and model our code as a succession of commands, with only success and error paths?\r\n\r\nWe'll work to refactor bloated logic. We'll extract and group code into meaningful objects called commands.\r\nThese commands will then be chained to handle success/failure and pass data."},{"conference_day":3,"start_time":"14:40","end_time":"15:20","program_session_id":127,"title":"Breaking Bad - What Happens When You Defy Conventions?","presenter":"Christoph Gockel","room":"South Ballroom","track":null,"description":"With Rails being over ten years old now, we know that the _Rails way_ works well.\r\nIt's battle tested and successful.\r\nBut not all problems we try to solve fit into its idea on how our application should be structured.\r\n\r\nCome along to find out what happens when you don't want to have an `app` directory anymore.\r\nWe will see what is needed in order to fight parts of the Rails convention and if it's worth it."},{"conference_day":3,"start_time":"14:40","end_time":"15:20","program_session_id":91,"title":"High Performance Political Revolutions","presenter":"Braulio Carreno","room":"164","track":"High Volume","description":"Bernie Sanders popularized crowdfunding in politics by raising $220 million in small donations.\r\n\r\nAn example of the challenges with handling a high volume of donations is the 2016 New Hampshire primary night, when Sanders asked a national TV audience to donate $27. Traffic peaked at 300K requests/min and 42 credit card transactions/sec.\r\n\r\nActBlue is the company behind the service used not only by Sanders, but also 16,600 other political organizations and charities for the past 12 years.\r\n\r\nThis presentation is about the lessons we learned building a high performance fundraising platform in Rails."},{"conference_day":3,"start_time":"14:40","end_time":"15:20","program_session_id":174,"title":"​Recurring Background Jobs with Sidekiq-scheduler","presenter":"Andreas Fast, Gianfranco Zas","room":"162","track":"Sponsored","description":"This is a sponsored talk by Moove-it.\r\n\r\nWhen background job processing needs arise, Sidekiq is the de facto choice. It's a great tool which has been around for years, but it doesn't provide recurring job processing out of the box. sidekiq-scheduler fills that gap, it's a Sidekiq extension to run background jobs in a recurring manner.\r\n\r\n\u2028In this talk, we'll cover how sidekiq-scheduler does its job, different use cases, challenges when running on distributed environments, its future, how we distribute capacity over open source initiatives, and as a bonus, how to write your own Sidekiq extensions."},{"conference_day":3,"start_time":"14:40","end_time":"15:20","program_session_id":130,"title":"Reporting on Rails - ActiveRecord and ROLAP Working Together","presenter":"Tony Drake","room":"160","track":null,"description":"It'll happen eventually. Someone will come down with a feature request for your app to \"create dashboards and reporting on our data\". So how do you go about doing it? What parts of your database should you start thinking about differently? What is \"reporting\" anyway? Is ActiveRecord enough to pull this off?\r\n\r\nLet's go on a journey through the world of Relational Online Analytical Processing (ROLAP) and see how this can apply to Rails. We'll also look at database considerations and finish with looking at a light DSL that works with ActiveRecord to help make your data dance."},{"conference_day":3,"start_time":"14:40","end_time":"15:20","program_session_id":124,"title":"Distributed Tracing: From Theory to Practice","presenter":"Stella Cotton","room":"156","track":null,"description":"Application performance monitoring is great for debugging inside a single app. However, as a system expands into multiple services, how can you understand the health of the system as a whole? Distributed tracing can help! You’ll learn the theory behind how distributed tracing works. But we’ll also dive into other practical considerations you won’t get from a README, like choosing libraries for Ruby apps and polyglot systems, infrastructure considerations, and security."},{"conference_day":3,"start_time":"15:30","end_time":"16:10","program_session_id":129,"title":"Managing Unmanageable Complexity","presenter":"Patrick Joyce","room":"South Ballroom","track":null,"description":"As systems get more complex they inevitably fail. Many of those failures are preventable.\r\n\r\nWe’re not lazy, stupid, or careless. The complexity of our systems simply exceeds our cognitive abilities. Thankfully, we’re not alone. People have successfully managed complex systems long before software came along. \r\n\r\nIn this session, we’ll see how surgeons, pilots, and builders have developed techniques to safely manage increasingly complex systems in life and death situations. We will learn how simple checklists improve communication, reduce preventable errors, and drive faster recovery time."},{"conference_day":3,"start_time":"15:30","end_time":"16:10","program_session_id":108,"title":"Panel: Performance... performance","presenter":"Sam Saffron, Nate Berkopec, Rafael França, Richard Schneeman, Eileen M. Uchitelle","room":"164","track":"High Volume","description":"Is your application running too slow? How can you make it run leaner and faster? Is Ruby 2.4 going to make anything faster or better? Should you be upgrading to the latest version of Rails? Is your Rails application being weighed down by a large swarm of dependencies? \r\n\r\nIn this panel, the panelists will discuss their favorite performance related tools and guidelines. Expect to learn about changes in Ruby 2.4 and beyond that may help make your applications snappy and lean. "},{"conference_day":3,"start_time":"15:30","end_time":"16:10","program_session_id":178,"title":"​Keeping Code Style Sanity in a 10-year-old Codebase","presenter":"Gabi Stefanini","room":"162","track":"Sponsored","description":"This is a sponsored talk by Shopify.\r\n\r\nConversations around code consistency seem to spark either cheers or jeers from developers. In this talk, I'll explore the good, bad, and the ugly of code style consistency as illustrated by the (sometimes drama-filled) history of Shopify's 10-year-old codebase. Highlighting strategies to help you evaluate when to push for better code consistency; you will hear about our techniques, tools and guides to enrich developer experience without compromising productivity and how to ultimately make code consistency important across the organization."},{"conference_day":3,"start_time":"15:30","end_time":"16:10","program_session_id":149,"title":"Do Your Views Know Too Much?","presenter":"Jason Charnes","room":"160","track":null,"description":"The logical place to put view-related logic is... inside your view, right? \"A little logic here... a little logic there...\" but all of a sudden we hardly recognize our views. A quick glance through our code and we can't tell our Ruby apart from our HTML. Don't worry; this is a fun opportunity for some refactoring! Come see several approaches you can start using today to clean up your views."},{"conference_day":3,"start_time":"15:30","end_time":"16:10","program_session_id":148,"title":"What’s my app *really* doing in production?","presenter":"Daniel Azuma","room":"156","track":null,"description":"When your Rails app begins serving public traffic, your users will make it behave in mysterious ways and find code paths you never knew existed. Understanding, measuring, and troubleshooting its behavior in production is a tough but crucial part of running a successful Rails app. In this talk, you’ll learn how to instrument, debug, and profile your app, using the capabilities of the Rails framework and the Ruby VM. You'll also study techniques for safely instrumenting a live running system, keeping latency to a minimum and avoiding side effects."},{"conference_day":3,"start_time":"16:10","end_time":"17:00","program_session_id":null,"title":"PM BREAK","presenter":"","room":"Exhibit Hall F\u0026G","track":null,"description":""},{"conference_day":3,"start_time":"17:00","end_time":"18:00","program_session_id":null,"title":"Keynote: Aaron Patterson","presenter":"","room":"South Ballroom","track":"Keynote","description":""}]